
/*!
 *  @header BAKit.h
 *
 *  @brief  BAKit
 *
 *  @author 博爱
 *  @copyright  Copyright © 2016年 博爱. All rights reserved.
 *  @version    V1.0
 */

//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                            O\ = /O
//                        ____/`---'\____
//                      .   ' \\| |// `.
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |
//                     | \_| ''\---/'' | |
//                      \ .-\__ `-` ___/-. /
//                   ___`. .' /--.--\ `. . __
//                ."" '< `.___\_<|>_/___.' >'"".
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                 \ \ `-. \_ __\ /__ _/ .-` / /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//
//         .............................................
//                  佛祖镇楼                  BUG辟易
//          佛曰:
//                一人 我编程累 累得只想把觉睡
//                两眼 是辛酸泪 代码咋写都不对
//
//                重启是也不行 关机它也不灵
//                我狂敲键盘怒砸鼠标 异常也不停
//
//                这循环它有点绕 注释也很微妙
//                我看了半天稀里糊涂马隔壁我草
//
//                加断点 再抵坝 堆栈瞬间就爆炸
//                日志输出如雨下 看到异常就害怕
//
//                调试一夜没人陪 心想这锅该归谁
//                回想当初心后悔 不该重构这地雷
//
//                翻日志 看半天 博客看了几百篇
//                闪退还是没复现 低头又点一根烟
//
//                加着班我心烦乱 烂摊子我不想干
//                离职损失就几万 一拍桌子把工作换
//
//                离职 我不再忙 在家 我守空房
//                我闲得无聊掏出电脑 代码又写几行

/*
 
 *********************************************************************************
 *
 * 在使用 BAKit 的过程中如果出现 bug 请及时以以下任意一种方式联系我，我会及时修复 bug
 *
 * QQ     : 可以添加ios开发技术群 479663605 在这里找到我(博爱1616【137361770】)
 * 微博    : 博爱1616
 * Email  : 137361770@qq.com
 * GitHub : https://github.com/boai
 * BAHome : https://github.com/BAHome
 * 博客    : http://boaihome.com
 
 *********************************************************************************
 
 */

#ifndef BAPrivacyManager_Version_h
#define BAPrivacyManager_Version_h

/*!
 *********************************************************************************
 ************************************ 更新说明 ************************************
 *********************************************************************************
 
 欢迎使用 BAHome 系列开源代码 ！
 如有更多需求，请前往：https://github.com/BAHome
 
 项目源码地址：
 OC 版 ：https://github.com/BAHome/BAPrivacyManager
 
 最新更新时间：2017-10-08【倒叙】<br>
 最新 Version：【Version：1.0.1】<br>
 更新内容：<br>
 1.0.1.1、优化注释 <br>

 最新更新时间：2017-10-07【倒叙】<br>
 最新 Version：【Version：1.0.0】<br>
 更新内容：<br>
 1.0.0.1、iOS 所有隐私权限封装，定位、蓝牙、通知、运动、日历、相册、相机等 14 种权限封装！详见 demo！ <br>

 */

#endif /* BAPrivacyManager_Version_h */
